START = "Приветствую тебя, путник, в моей сувенирной лавке. \n Могу предложить тебе купить слона."
ARGUMENTS = ["Купи слона!", "Слону одиноко, купи слона!", "Я тебе скидку сделаю, купи слона!",
             "Ковер в подарок при покупке слона, купишь слона?", "Два слона по цене одного, купи слона!"]


def elephant():
    i = 0
    word = ''
    while word != 'yes' and i < 5:
        print(ARGUMENTS[i])
        word = input()
        i += 1
    if word == "yes":
        return "Поздравляю, теперь у вас есть слон!"
    else:
        return "Вы остались без слона."


if __name__ == '__main__':
    print(START)
    print(elephant())
